Мониторинг/src/Documents/ЗагрузкаРезультатовМониторинга/ЗагрузкаРезультатовМониторинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗагрузкаРезультатовМониторинга</name>
  <registerRecords>InformationRegister.ЦеныКонкурентов</registerRecords>
  <attributes>
    <name>Конкурент</name>
    <type>
      <types>CatalogRef.Конкуренты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипМониторинга</name>
    <type>
      <types>CatalogRef.ТипМониторинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсполнительМагазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсполнительФизЛицо</name>
    <type>
      <types>CatalogRef.ФизЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Посещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>РезультатыМониторинга</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаКонкурента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Акция</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Пропущено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Отсутствует</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИменаКартинок</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Мониторинг/src/InformationRegisters/РезультатыМониторинга/РезультатыМониторинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезультатыМониторинга</name>
  <resources>
    <name>ЦенаКонкурента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Акция</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Пропущено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отсутствует</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИменаКартинок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИсполнительМагазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </resources>
  <resources>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипМониторинга</name>
    <type>
      <types>CatalogRef.ТипМониторинга</types>
    </type>
  </resources>
  <resources>
    <name>КомментарийКНоменклатуре</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Конкурент</name>
    <type>
      <types>CatalogRef.Конкуренты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаМониторинга</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Мониторинг/src/InformationRegisters/ЦеныКонкурентов/ЦеныКонкурентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныКонкурентов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрошлаяЦена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПрошлойЦены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Конкурент</name>
    <type>
      <types>CatalogRef.Конкуренты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Мониторинг/src/Documents/ЗагрузкаРезультатовМониторинга/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр РезультатыМониторинга
	МассивНоменклатуры = Новый Массив;
	Для Каждого ТекСтрокаРезультатыМониторинга Из РезультатыМониторинга Цикл
		Для Каждого Магазин Из Конкурент.Магазины Цикл 
			Движение = РегистрыСведений.РезультатыМониторинга.СоздатьМенеджерЗаписи();
			Движение.ДатаМониторинга = Дата;
			Движение.Конкурент = Конкурент;
			Движение.Номенклатура = ТекСтрокаРезультатыМониторинга.Номенклатура;
			Движение.ИсполнительМагазин = ИсполнительМагазин;
			Движение.ЦенаКонкурента = ТекСтрокаРезультатыМониторинга.ЦенаКонкурента;
			Движение.Акция = ТекСтрокаРезультатыМониторинга.Акция;
			Движение.Пропущено = ТекСтрокаРезультатыМониторинга.Пропущено;
			Движение.Отсутствует = ТекСтрокаРезультатыМониторинга.Отсутствует;
			Движение.ИменаКартинок = ТекСтрокаРезультатыМониторинга.ИменаКартинок;
			Движение.Магазин = Магазин.Магазин;
			Движение.ТипМониторинга = ТипМониторинга;
			Движение.КомментарийКНоменклатуре = ТекСтрокаРезультатыМониторинга.Комментарий;
			Движение.Записать(Истина);
		КонецЦикла;
		Если ТекСтрокаРезультатыМониторинга.ЦенаКонкурента>0 Тогда 
			МассивНоменклатуры.Добавить(ТекСтрокаРезультатыМониторинга.Номенклатура);
		КонецЕсли;
	КонецЦикла;

	// регистр ЦеныКонкурентов
	Движения.ЦеныКонкурентов.Записывать = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныКонкурентовСрезПоследних.Цена,
		|	ЦеныКонкурентовСрезПоследних.Период,
		|	ЦеныКонкурентовСрезПоследних.Номенклатура
		|ИЗ
		|	РегистрСведений.ЦеныКонкурентов.СрезПоследних(
		|			&ДатаСреза,
		|			Номенклатура В (&МассивНоменклатуры)
		|				И Конкурент = &Конкурент) КАК ЦеныКонкурентовСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаСреза", Дата-1);
	Запрос.УстановитьПараметр("Конкурент", Конкурент);
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	
	ТЗ_Поиск = Запрос.Выполнить().Выгрузить();
	ТЗ_Поиск.Индексы.Добавить("Номенклатура");
	
	Для Каждого ТекСтрокаРезультатыМониторинга Из РезультатыМониторинга Цикл
		Если ТекСтрокаРезультатыМониторинга.ЦенаКонкурента>0 И ЗначениеЗаполнено(ТекСтрокаРезультатыМониторинга.Номенклатура) Тогда 
			Движение = Движения.ЦеныКонкурентов.Добавить();
			Движение.Период = Дата;
			Движение.Конкурент = Конкурент;
			Движение.Номенклатура = ТекСтрокаРезультатыМониторинга.Номенклатура;
			Движение.Цена = ТекСтрокаРезультатыМониторинга.ЦенаКонкурента;
			СтрокаПоиск = ТЗ_Поиск.Найти(ТекСтрокаРезультатыМониторинга.Номенклатура, "Номенклатура");
			Если НЕ СтрокаПоиск = Неопределено Тогда 
				Движение.ДатаПрошлойЦены = СтрокаПоиск.Период;
				Движение.ПрошлаяЦена = СтрокаПоиск.Цена;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
